[Killed] EqualityOperator
repos/cypress-demo/js/todoItem.jsx:58:5
 			return (
 				nextProps.todo !== this.props.todo ||
 				nextProps.editing !== this.props.editing ||
-				nextState.editText !== this.state.editText
+				nextState.editText === this.state.editText
 			);
 		},
