[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:6:11
 /*jshint trailing:false */
 /*jshint newcap:false */
 /*global React, Router*/
-var app = app || {};
+var app = false;
 
 (function () {
