[Killed] LogicalOperator
repos/cypress-demo/js/app.jsx:6:11
 /*jshint trailing:false */
 /*jshint newcap:false */
 /*global React, Router*/
-var app = app || {};
+var app = app && {};
 
 (function () {

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:6:11
 /*jshint trailing:false */
 /*jshint newcap:false */
 /*global React, Router*/
-var app = app || {};
+var app = true;
 
 (function () {

[Killed] StringLiteral
repos/cypress-demo/js/app.jsx:13:24
 
 	app.ALL_TODOS = 'all';
 	app.ACTIVE_TODOS = 'active';
-	app.COMPLETED_TODOS = 'completed';
+	app.COMPLETED_TODOS = "";
 	var TodoFooter = app.TodoFooter;
 	var TodoItem = app.TodoItem;

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:20:32
 	var ENTER_KEY = 13;
 
 	var TodoApp = React.createClass({
-		getInitialState: function () {
-			return {
-				nowShowing: app.ALL_TODOS,
-				editing: null
-			};
-		},
+		getInitialState: function () {},
 
 		componentDidMount: function () {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:27:34
 			};
 		},
 
-		componentDidMount: function () {
-			var setState = this.setState;
-			var router = Router({
-				'/': setState.bind(this, {nowShowing: app.ALL_TODOS}),
-				'/active': setState.bind(this, {nowShowing: app.ACTIVE_TODOS}),
-				'/completed': setState.bind(this, {nowShowing: app.COMPLETED_TODOS})
-			});
-			router.init('/');
-		},
+		componentDidMount: function () {},
 
 		handleNewTodoKeyDown: function (event) {

[Killed] ObjectLiteral
repos/cypress-demo/js/app.jsx:32:39
 			var router = Router({
 				'/': setState.bind(this, {nowShowing: app.ALL_TODOS}),
 				'/active': setState.bind(this, {nowShowing: app.ACTIVE_TODOS}),
-				'/completed': setState.bind(this, {nowShowing: app.COMPLETED_TODOS})
+				'/completed': setState.bind(this, {})
 			});
 			router.init('/');

[Killed] StringLiteral
repos/cypress-demo/js/app.jsx:34:16
 				'/active': setState.bind(this, {nowShowing: app.ACTIVE_TODOS}),
 				'/completed': setState.bind(this, {nowShowing: app.COMPLETED_TODOS})
 			});
-			router.init('/');
+			router.init("");
 		},
 

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:37:42
 			router.init('/');
 		},
 
-		handleNewTodoKeyDown: function (event) {
-			if (event.keyCode !== ENTER_KEY) {
-				return;
-			}
-
-			event.preventDefault();
-
-			var val = React.findDOMNode(this.refs.newField).value.trim();
-
-			if (val) {
-				this.props.model.addTodo(val);
-				React.findDOMNode(this.refs.newField).value = '';
-			}
-		},
+		handleNewTodoKeyDown: function (event) {},
 
 		toggleAll: function (event) {

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:38:8
 		},
 
 		handleNewTodoKeyDown: function (event) {
-			if (event.keyCode !== ENTER_KEY) {
+			if (true) {
 				return;
 			}

[Killed] EqualityOperator
repos/cypress-demo/js/app.jsx:38:8
 		},
 
 		handleNewTodoKeyDown: function (event) {
-			if (event.keyCode !== ENTER_KEY) {
+			if (event.keyCode === ENTER_KEY) {
 				return;
 			}

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:46:13
 
 			var val = React.findDOMNode(this.refs.newField).value.trim();
 
-			if (val) {
-				this.props.model.addTodo(val);
-				React.findDOMNode(this.refs.newField).value = '';
-			}
+			if (val) {}
 		},
 

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:46:8
 
 			var val = React.findDOMNode(this.refs.newField).value.trim();
 
-			if (val) {
+			if (false) {
 				this.props.model.addTodo(val);
 				React.findDOMNode(this.refs.newField).value = '';

[Killed] StringLiteral
repos/cypress-demo/js/app.jsx:48:51
 
 			if (val) {
 				this.props.model.addTodo(val);
-				React.findDOMNode(this.refs.newField).value = '';
+				React.findDOMNode(this.refs.newField).value = "Stryker was here!";
 			}
 		},

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:52:31
 			}
 		},
 
-		toggleAll: function (event) {
-			var checked = event.target.checked;
-			this.props.model.toggleAll(checked);
-		},
+		toggleAll: function (event) {},
 
 		toggle: function (todoToToggle) {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:57:35
 			this.props.model.toggleAll(checked);
 		},
 
-		toggle: function (todoToToggle) {
-			this.props.model.toggle(todoToToggle);
-		},
+		toggle: function (todoToToggle) {},
 
 		destroy: function (todo) {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:61:28
 			this.props.model.toggle(todoToToggle);
 		},
 
-		destroy: function (todo) {
-			this.props.model.destroy(todo);
-		},
+		destroy: function (todo) {},
 
 		edit: function (todo) {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:65:25
 			this.props.model.destroy(todo);
 		},
 
-		edit: function (todo) {
-			this.setState({editing: todo.id});
-		},
+		edit: function (todo) {},
 
 		save: function (todoToSave, text) {

[Killed] ObjectLiteral
repos/cypress-demo/js/app.jsx:66:18
 		},
 
 		edit: function (todo) {
-			this.setState({editing: todo.id});
+			this.setState({});
 		},
 

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:69:37
 			this.setState({editing: todo.id});
 		},
 
-		save: function (todoToSave, text) {
-			this.props.model.save(todoToSave, text);
-			this.setState({editing: null});
-		},
+		save: function (todoToSave, text) {},
 
 		cancel: function () {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:74:23
 			this.setState({editing: null});
 		},
 
-		cancel: function () {
-			this.setState({editing: null});
-		},
+		cancel: function () {},
 
 		clearCompleted: function () {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:78:31
 			this.setState({editing: null});
 		},
 
-		clearCompleted: function () {
-			this.props.model.clearCompleted();
-		},
+		clearCompleted: function () {},
 
 		render: function () {

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:87:50
 			var main;
 			var todos = this.props.model.todos;
 
-			var shownTodos = todos.filter(function (todo) {
-				switch (this.state.nowShowing) {
-				case app.ACTIVE_TODOS:
-					return !todo.completed;
-				case app.COMPLETED_TODOS:
-					return todo.completed;
-				default:
-					return true;
-				}
-			}, this);
+			var shownTodos = todos.filter(function (todo) {}, this);
 
 			var todoItems = shownTodos.map(function (todo) {

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:89:5
 
 			var shownTodos = todos.filter(function (todo) {
 				switch (this.state.nowShowing) {
-				case app.ACTIVE_TODOS:
-					return !todo.completed;
+				case app.ACTIVE_TODOS:
 				case app.COMPLETED_TODOS:
 					return todo.completed;

[Killed] BooleanLiteral
repos/cypress-demo/js/app.jsx:90:13
 			var shownTodos = todos.filter(function (todo) {
 				switch (this.state.nowShowing) {
 				case app.ACTIVE_TODOS:
-					return !todo.completed;
+					return todo.completed;
 				case app.COMPLETED_TODOS:
 					return todo.completed;

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:91:5
 				switch (this.state.nowShowing) {
 				case app.ACTIVE_TODOS:
 					return !todo.completed;
-				case app.COMPLETED_TODOS:
-					return todo.completed;
+				case app.COMPLETED_TODOS:
 				default:
 					return true;

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:93:5
 					return !todo.completed;
 				case app.COMPLETED_TODOS:
 					return todo.completed;
-				default:
-					return true;
+				default:
 				}
 			}, this);

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:98:51
 				}
 			}, this);
 
-			var todoItems = shownTodos.map(function (todo) {
-				return (
-					<TodoItem
-						key={todo.id}
-						todo={todo}
-						onToggle={this.toggle.bind(this, todo)}
-						onDestroy={this.destroy.bind(this, todo)}
-						onEdit={this.edit.bind(this, todo)}
-						editing={this.state.editing === todo.id}
-						onSave={this.save.bind(this, todo)}
-						onCancel={this.cancel}
-					/>
-				);
-			}, this);
+			var todoItems = shownTodos.map(function (todo) {}, this);
 
 			var activeTodoCount = todos.reduce(function (accum, todo) {

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:106:16
 						onToggle={this.toggle.bind(this, todo)}
 						onDestroy={this.destroy.bind(this, todo)}
 						onEdit={this.edit.bind(this, todo)}
-						editing={this.state.editing === todo.id}
+						editing={true}
 						onSave={this.save.bind(this, todo)}
 						onCancel={this.cancel}

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:106:16
 						onToggle={this.toggle.bind(this, todo)}
 						onDestroy={this.destroy.bind(this, todo)}
 						onEdit={this.edit.bind(this, todo)}
-						editing={this.state.editing === todo.id}
+						editing={false}
 						onSave={this.save.bind(this, todo)}
 						onCancel={this.cancel}

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:113:62
 				);
 			}, this);
 
-			var activeTodoCount = todos.reduce(function (accum, todo) {
-				return todo.completed ? accum : accum + 1;
-			}, 0);
+			var activeTodoCount = todos.reduce(function (accum, todo) {}, 0);
 
 			var completedCount = todos.length - activeTodoCount;

[Killed] ArithmeticOperator
repos/cypress-demo/js/app.jsx:114:37
 			}, this);
 
 			var activeTodoCount = todos.reduce(function (accum, todo) {
-				return todo.completed ? accum : accum + 1;
+				return todo.completed ? accum : accum - 1;
 			}, 0);
 

[Killed] ArithmeticOperator
repos/cypress-demo/js/app.jsx:117:25
 				return todo.completed ? accum : accum + 1;
 			}, 0);
 
-			var completedCount = todos.length - activeTodoCount;
+			var completedCount = todos.length + activeTodoCount;
 
 			if (activeTodoCount || completedCount) {

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:119:8
 
 			var completedCount = todos.length - activeTodoCount;
 
-			if (activeTodoCount || completedCount) {
+			if (false) {
 				footer =
 					<TodoFooter

[Killed] LogicalOperator
repos/cypress-demo/js/app.jsx:119:8
 
 			var completedCount = todos.length - activeTodoCount;
 
-			if (activeTodoCount || completedCount) {
+			if (activeTodoCount && completedCount) {
 				footer =
 					<TodoFooter

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:129:8
 					/>;
 			}
 
-			if (todos.length) {
+			if (false) {
 				main = (
 					<section className="main">

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:129:8
 					/>;
 			}
 
-			if (todos.length) {
+			if (true) {
 				main = (
 					<section className="main">

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:136:17
 							className="toggle-all"
 							type="checkbox"
 							onChange={this.toggleAll}
-							checked={activeTodoCount === 0}
+							checked={true}
 						/>
 						<ul className="todo-list">

[Killed] ConditionalExpression
repos/cypress-demo/js/app.jsx:136:17
 							className="toggle-all"
 							type="checkbox"
 							onChange={this.toggleAll}
-							checked={activeTodoCount === 0}
+							checked={false}
 						/>
 						<ul className="todo-list">

[Killed] BooleanLiteral
repos/cypress-demo/js/app.jsx:154:19
 							className="new-todo"
 							placeholder="What needs to be done?"
 							onKeyDown={this.handleNewTodoKeyDown}
-							autoFocus={true}
+							autoFocus={false}
 						/>
 					</header>

[Killed] BlockStatement
repos/cypress-demo/js/app.jsx:166:20
 
 	var model = new app.TodoModel('react-todos');
 
-	function render() {
-		React.render(
-			<TodoApp model={model}/>,
-			document.getElementsByClassName('todoapp')[0]
-		);
-	}
+	function render() {}
 
 	model.subscribe(render);
