[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:6:11
 /*jshint trailing:false */
 /*jshint newcap:false */
 /*global React */
-var app = app || {};
+var app = false;
 
 (function () {

[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:6:11
 /*jshint trailing:false */
 /*jshint newcap:false */
 /*global React */
-var app = app || {};
+var app = true;
 
 (function () {

[Killed] EqualityOperator
repos/cypress-demo/js/footer.jsx:16:8
 			var activeTodoWord = app.Utils.pluralize(this.props.count, 'item');
 			var clearButton = null;
 
-			if (this.props.completedCount > 0) {
+			if (this.props.completedCount <= 0) {
 				clearButton = (
 					<button

[Killed] BlockStatement
repos/cypress-demo/js/footer.jsx:16:39
 			var activeTodoWord = app.Utils.pluralize(this.props.count, 'item');
 			var clearButton = null;
 
-			if (this.props.completedCount > 0) {
-				clearButton = (
-					<button
-						className="clear-completed"
-						onClick={this.props.onClearCompleted}>
-						Clear completed
-					</button>
-				);
-			}
+			if (this.props.completedCount > 0) {}
 
 			// React idiom for shortcutting to `classSet` since it'll be used often

[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:38:34
 						<li>
 							<a
 								href="#/"
-								className={cx({selected: nowShowing === app.ALL_TODOS})}>
+								className={cx({selected: false})}>
 									All
 							</a>

[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:38:34
 						<li>
 							<a
 								href="#/"
-								className={cx({selected: nowShowing === app.ALL_TODOS})}>
+								className={cx({selected: true})}>
 									All
 							</a>

[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:46:34
 						<li>
 							<a
 								href="#/active"
-								className={cx({selected: nowShowing === app.ACTIVE_TODOS})}>
+								className={cx({selected: false})}>
 									Active
 							</a>

[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:46:34
 						<li>
 							<a
 								href="#/active"
-								className={cx({selected: nowShowing === app.ACTIVE_TODOS})}>
+								className={cx({selected: true})}>
 									Active
 							</a>

[Killed] EqualityOperator
repos/cypress-demo/js/footer.jsx:54:34
 						<li>
 							<a
 								href="#/completed"
-								className={cx({selected: nowShowing === app.COMPLETED_TODOS})}>
+								className={cx({selected: nowShowing !== app.COMPLETED_TODOS})}>
 									Completed
 							</a>

[Killed] ConditionalExpression
repos/cypress-demo/js/footer.jsx:54:34
 						<li>
 							<a
 								href="#/completed"
-								className={cx({selected: nowShowing === app.COMPLETED_TODOS})}>
+								className={cx({selected: false})}>
 									Completed
 							</a>
