[Killed] LogicalOperator
repos/cypress-demo/js/todoItem.jsx:6:11
 /*jshint trailing: false */
 /*jshint newcap: false */
 /*global React */
-var app = app || {};
+var app = app && {};
 
 (function () {

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:15:34
 	var ENTER_KEY = 13;
 
 	app.TodoItem = React.createClass({
-		handleSubmit: function (event) {
-			var val = this.state.editText.trim();
-			if (val) {
-				this.props.onSave(val);
-				this.setState({editText: val});
-			} else {
-				this.props.onDestroy();
-			}
-		},
+		handleSubmit: function (event) {},
 
 		handleEdit: function () {

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:17:8
 	app.TodoItem = React.createClass({
 		handleSubmit: function (event) {
 			var val = this.state.editText.trim();
-			if (val) {
+			if (true) {
 				this.props.onSave(val);
 				this.setState({editText: val});

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:17:8
 	app.TodoItem = React.createClass({
 		handleSubmit: function (event) {
 			var val = this.state.editText.trim();
-			if (val) {
+			if (false) {
 				this.props.onSave(val);
 				this.setState({editText: val});

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:20:11
 			if (val) {
 				this.props.onSave(val);
 				this.setState({editText: val});
-			} else {
-				this.props.onDestroy();
-			}
+			} else {}
 		},
 

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:25:27
 			}
 		},
 
-		handleEdit: function () {
-			this.props.onEdit();
-			this.setState({editText: this.props.todo.title});
-		},
+		handleEdit: function () {},
 
 		handleKeyDown: function (event) {

[Killed] ObjectLiteral
repos/cypress-demo/js/todoItem.jsx:27:18
 
 		handleEdit: function () {
 			this.props.onEdit();
-			this.setState({editText: this.props.todo.title});
+			this.setState({});
 		},
 

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:30:35
 			this.setState({editText: this.props.todo.title});
 		},
 
-		handleKeyDown: function (event) {
-			if (event.which === ESCAPE_KEY) {
-				this.setState({editText: this.props.todo.title});
-				this.props.onCancel(event);
-			} else if (event.which === ENTER_KEY) {
-				this.handleSubmit(event);
-			}
-		},
+		handleKeyDown: function (event) {},
 
 		handleChange: function (event) {

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:31:8
 		},
 
 		handleKeyDown: function (event) {
-			if (event.which === ESCAPE_KEY) {
+			if (true) {
 				this.setState({editText: this.props.todo.title});
 				this.props.onCancel(event);

[Killed] EqualityOperator
repos/cypress-demo/js/todoItem.jsx:31:8
 		},
 
 		handleKeyDown: function (event) {
-			if (event.which === ESCAPE_KEY) {
+			if (event.which !== ESCAPE_KEY) {
 				this.setState({editText: this.props.todo.title});
 				this.props.onCancel(event);

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:34:15
 			if (event.which === ESCAPE_KEY) {
 				this.setState({editText: this.props.todo.title});
 				this.props.onCancel(event);
-			} else if (event.which === ENTER_KEY) {
+			} else if (true) {
 				this.handleSubmit(event);
 			}

[Killed] EqualityOperator
repos/cypress-demo/js/todoItem.jsx:34:15
 			if (event.which === ESCAPE_KEY) {
 				this.setState({editText: this.props.todo.title});
 				this.props.onCancel(event);
-			} else if (event.which === ENTER_KEY) {
+			} else if (event.which !== ENTER_KEY) {
 				this.handleSubmit(event);
 			}

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:39:34
 			}
 		},
 
-		handleChange: function (event) {
-			this.setState({editText: event.target.value});
-		},
+		handleChange: function (event) {},
 
 		getInitialState: function () {

[Killed] ObjectLiteral
repos/cypress-demo/js/todoItem.jsx:40:18
 		},
 
 		handleChange: function (event) {
-			this.setState({editText: event.target.value});
+			this.setState({});
 		},
 

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:43:32
 			this.setState({editText: event.target.value});
 		},
 
-		getInitialState: function () {
-			return {editText: this.props.todo.title};
-		},
+		getInitialState: function () {},
 
 		/**

[Killed] ObjectLiteral
repos/cypress-demo/js/todoItem.jsx:44:11
 		},
 
 		getInitialState: function () {
-			return {editText: this.props.todo.title};
+			return {};
 		},
 

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:54:58
 		 * just use it as an example of how little code it takes to get an order
 		 * of magnitude performance improvement.
 		 */
-		shouldComponentUpdate: function (nextProps, nextState) {
-			return (
-				nextProps.todo !== this.props.todo ||
-				nextProps.editing !== this.props.editing ||
-				nextState.editText !== this.state.editText
-			);
-		},
+		shouldComponentUpdate: function (nextProps, nextState) {},
 
 		/**

[Killed] LogicalOperator
repos/cypress-demo/js/todoItem.jsx:56:5
 		 */
 		shouldComponentUpdate: function (nextProps, nextState) {
 			return (
-				nextProps.todo !== this.props.todo ||
-				nextProps.editing !== this.props.editing ||
+				nextProps.todo !== this.props.todo && nextProps.editing !== this.props.editing ||
 				nextState.editText !== this.state.editText
 			);

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:56:5
 		 */
 		shouldComponentUpdate: function (nextProps, nextState) {
 			return (
-				nextProps.todo !== this.props.todo ||
-				nextProps.editing !== this.props.editing ||
-				nextState.editText !== this.state.editText
+				false
 			);
 		},

[Killed] EqualityOperator
repos/cypress-demo/js/todoItem.jsx:57:5
 		shouldComponentUpdate: function (nextProps, nextState) {
 			return (
 				nextProps.todo !== this.props.todo ||
-				nextProps.editing !== this.props.editing ||
+				nextProps.editing === this.props.editing ||
 				nextState.editText !== this.state.editText
 			);

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:57:5
 		shouldComponentUpdate: function (nextProps, nextState) {
 			return (
 				nextProps.todo !== this.props.todo ||
-				nextProps.editing !== this.props.editing ||
+				true ||
 				nextState.editText !== this.state.editText
 			);

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:58:5
 			return (
 				nextProps.todo !== this.props.todo ||
 				nextProps.editing !== this.props.editing ||
-				nextState.editText !== this.state.editText
+				true
 			);
 		},

[Killed] ConditionalExpression
repos/cypress-demo/js/todoItem.jsx:58:5
 			return (
 				nextProps.todo !== this.props.todo ||
 				nextProps.editing !== this.props.editing ||
-				nextState.editText !== this.state.editText
+				false
 			);
 		},

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:68:44
 		 * For more info refer to notes at https://facebook.github.io/react/docs/component-api.html#setstate
 		 * and https://facebook.github.io/react/docs/component-specs.html#updating-componentdidupdate
 		 */
-		componentDidUpdate: function (prevProps) {
-			if (!prevProps.editing && this.props.editing) {
-				var node = React.findDOMNode(this.refs.editField);
-				node.focus();
-				node.setSelectionRange(node.value.length, node.value.length);
-			}
-		},
+		componentDidUpdate: function (prevProps) {},
 
 		render: function () {

[Killed] BooleanLiteral
repos/cypress-demo/js/todoItem.jsx:69:8
 		 * and https://facebook.github.io/react/docs/component-specs.html#updating-componentdidupdate
 		 */
 		componentDidUpdate: function (prevProps) {
-			if (!prevProps.editing && this.props.editing) {
+			if (prevProps.editing && this.props.editing) {
 				var node = React.findDOMNode(this.refs.editField);
 				node.focus();

[Killed] BlockStatement
repos/cypress-demo/js/todoItem.jsx:69:50
 		 * and https://facebook.github.io/react/docs/component-specs.html#updating-componentdidupdate
 		 */
 		componentDidUpdate: function (prevProps) {
-			if (!prevProps.editing && this.props.editing) {
-				var node = React.findDOMNode(this.refs.editField);
-				node.focus();
-				node.setSelectionRange(node.value.length, node.value.length);
-			}
+			if (!prevProps.editing && this.props.editing) {}
 		},
 
