[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:2:11
 /* eslint-disable-next-line no-var */
-var app = app || {}
+var app = false
 
 ;(function () {

[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:2:11
 /* eslint-disable-next-line no-var */
-var app = app || {}
+var app = true
 
 ;(function () {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:14:34
   // may not even be worth separating this logic
   // out, but we do this to demonstrate one way to
   // separate out parts of your application.
-  app.TodoModel = function (key) {
-    this.key = key
-    this.todos = Utils.store(key)
-    this.onChanges = []
-  }
+  app.TodoModel = function (key) {}
 
   app.TodoModel.prototype.subscribe = function (onChange) {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:20:59
     this.onChanges = []
   }
 
-  app.TodoModel.prototype.subscribe = function (onChange) {
-    this.onChanges.push(onChange)
-  }
+  app.TodoModel.prototype.subscribe = function (onChange) {}
 
   app.TodoModel.prototype.inform = function () {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:24:48
     this.onChanges.push(onChange)
   }
 
-  app.TodoModel.prototype.inform = function () {
-    Utils.store(this.key, this.todos)
-    this.onChanges.forEach(function (cb) { cb() })
-  }
+  app.TodoModel.prototype.inform = function () {}
 
   app.TodoModel.prototype.addTodo = function (title) {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:26:42
 
   app.TodoModel.prototype.inform = function () {
     Utils.store(this.key, this.todos)
-    this.onChanges.forEach(function (cb) { cb() })
+    this.onChanges.forEach(function (cb) {})
   }
 

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:29:54
     this.onChanges.forEach(function (cb) { cb() })
   }
 
-  app.TodoModel.prototype.addTodo = function (title) {
-    this.todos = this.todos.concat({
-      id: Utils.uuid(),
-      title,
-      completed: false,
-    })
-
-    this.inform()
-  }
+  app.TodoModel.prototype.addTodo = function (title) {}
 
   app.TodoModel.prototype.toggleAll = function (checked) {

[Killed] ObjectLiteral
repos/cypress-demo/js/todoModel.js:30:36
   }
 
   app.TodoModel.prototype.addTodo = function (title) {
-    this.todos = this.todos.concat({
-      id: Utils.uuid(),
-      title,
-      completed: false,
-    })
+    this.todos = this.todos.concat({})
 
     this.inform()

[Killed] BooleanLiteral
repos/cypress-demo/js/todoModel.js:33:18
     this.todos = this.todos.concat({
       id: Utils.uuid(),
       title,
-      completed: false,
+      completed: true,
     })
 

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:39:58
     this.inform()
   }
 
-  app.TodoModel.prototype.toggleAll = function (checked) {
-    // Note: it's usually better to use immutable data structures since they're
-    // easier to reason about and React works very well with them. That's why
-    // we use map() and filter() everywhere instead of mutating the array or
-    // todo items themselves.
-    this.todos = this.todos.map(function (todo) {
-      return Utils.extend({}, todo, { completed: checked })
-    })
-
-    this.inform()
-  }
+  app.TodoModel.prototype.toggleAll = function (checked) {}
 
   app.TodoModel.prototype.toggle = function (todoToToggle) {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:44:49
     // easier to reason about and React works very well with them. That's why
     // we use map() and filter() everywhere instead of mutating the array or
     // todo items themselves.
-    this.todos = this.todos.map(function (todo) {
-      return Utils.extend({}, todo, { completed: checked })
-    })
+    this.todos = this.todos.map(function (todo) {})
 
     this.inform()

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:51:60
     this.inform()
   }
 
-  app.TodoModel.prototype.toggle = function (todoToToggle) {
-    this.todos = this.todos.map(function (todo) {
-      return todo !== todoToToggle ?
-        todo :
-        Utils.extend({}, todo, { completed: !todo.completed })
-    })
-
-    this.inform()
-  }
+  app.TodoModel.prototype.toggle = function (todoToToggle) {}
 
   app.TodoModel.prototype.destroy = function (todo) {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:52:49
   }
 
   app.TodoModel.prototype.toggle = function (todoToToggle) {
-    this.todos = this.todos.map(function (todo) {
-      return todo !== todoToToggle ?
-        todo :
-        Utils.extend({}, todo, { completed: !todo.completed })
-    })
+    this.todos = this.todos.map(function (todo) {})
 
     this.inform()

[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:53:14
 
   app.TodoModel.prototype.toggle = function (todoToToggle) {
     this.todos = this.todos.map(function (todo) {
-      return todo !== todoToToggle ?
+      return false ?
         todo :
         Utils.extend({}, todo, { completed: !todo.completed })

[Killed] EqualityOperator
repos/cypress-demo/js/todoModel.js:53:14
 
   app.TodoModel.prototype.toggle = function (todoToToggle) {
     this.todos = this.todos.map(function (todo) {
-      return todo !== todoToToggle ?
+      return todo === todoToToggle ?
         todo :
         Utils.extend({}, todo, { completed: !todo.completed })

[Killed] BooleanLiteral
repos/cypress-demo/js/todoModel.js:55:45
     this.todos = this.todos.map(function (todo) {
       return todo !== todoToToggle ?
         todo :
-        Utils.extend({}, todo, { completed: !todo.completed })
+        Utils.extend({}, todo, { completed: todo.completed })
     })
 

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:61:53
     this.inform()
   }
 
-  app.TodoModel.prototype.destroy = function (todo) {
-    this.todos = this.todos.filter(function (candidate) {
-      return candidate !== todo
-    })
-
-    this.inform()
-  }
+  app.TodoModel.prototype.destroy = function (todo) {}
 
   app.TodoModel.prototype.save = function (todoToSave, text) {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:62:57
   }
 
   app.TodoModel.prototype.destroy = function (todo) {
-    this.todos = this.todos.filter(function (candidate) {
-      return candidate !== todo
-    })
+    this.todos = this.todos.filter(function (candidate) {})
 
     this.inform()

[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:63:14
 
   app.TodoModel.prototype.destroy = function (todo) {
     this.todos = this.todos.filter(function (candidate) {
-      return candidate !== todo
+      return true
     })
 

[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:63:14
 
   app.TodoModel.prototype.destroy = function (todo) {
     this.todos = this.todos.filter(function (candidate) {
-      return candidate !== todo
+      return false
     })
 

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:69:62
     this.inform()
   }
 
-  app.TodoModel.prototype.save = function (todoToSave, text) {
-    this.todos = this.todos.map(function (todo) {
-      return todo !== todoToSave ? todo : Utils.extend({}, todo, { title: text })
-    })
-
-    this.inform()
-  }
+  app.TodoModel.prototype.save = function (todoToSave, text) {}
 
   app.TodoModel.prototype.clearCompleted = function () {

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:70:49
   }
 
   app.TodoModel.prototype.save = function (todoToSave, text) {
-    this.todos = this.todos.map(function (todo) {
-      return todo !== todoToSave ? todo : Utils.extend({}, todo, { title: text })
-    })
+    this.todos = this.todos.map(function (todo) {})
 
     this.inform()

[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:71:14
 
   app.TodoModel.prototype.save = function (todoToSave, text) {
     this.todos = this.todos.map(function (todo) {
-      return todo !== todoToSave ? todo : Utils.extend({}, todo, { title: text })
+      return false ? todo : Utils.extend({}, todo, { title: text })
     })
 

[Killed] ConditionalExpression
repos/cypress-demo/js/todoModel.js:71:14
 
   app.TodoModel.prototype.save = function (todoToSave, text) {
     this.todos = this.todos.map(function (todo) {
-      return todo !== todoToSave ? todo : Utils.extend({}, todo, { title: text })
+      return true ? todo : Utils.extend({}, todo, { title: text })
     })
 

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:77:56
     this.inform()
   }
 
-  app.TodoModel.prototype.clearCompleted = function () {
-    this.todos = this.todos.filter(function (todo) {
-      return !todo.completed
-    })
-
-    this.inform()
-  }
+  app.TodoModel.prototype.clearCompleted = function () {}
 
 })()

[Killed] BlockStatement
repos/cypress-demo/js/todoModel.js:78:52
   }
 
   app.TodoModel.prototype.clearCompleted = function () {
-    this.todos = this.todos.filter(function (todo) {
-      return !todo.completed
-    })
+    this.todos = this.todos.filter(function (todo) {})
 
     this.inform()

[Killed] BooleanLiteral
repos/cypress-demo/js/todoModel.js:79:14
 
   app.TodoModel.prototype.clearCompleted = function () {
     this.todos = this.todos.filter(function (todo) {
-      return !todo.completed
+      return todo.completed
     })
 
