[Killed] LogicalOperator
repos/cypress-demo/js/utils.js:3:11
 /* eslint-env browser */
 /* eslint-disable-next-line no-var */
-var app = app || {}
+var app = app && {}
 
 ;(function () {

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:9:13
   'use strict'
 
   app.Utils = {
-    uuid () {
-      /*jshint bitwise:false */
-      let i; let random
-      let uuid = ''
-
-      for (i = 0; i < 32; i++) {
-        random = Math.random() * 16 | 0
-        if (i === 8 || i === 12 || i === 16 || i === 20) {
-          uuid += '-'
-        }
-
-        uuid += (i === 12 ? 4 : (i === 16 ? (random & 3 | 8) : random))
-        .toString(16)
-      }
-
-      return uuid
-    },
+    uuid () {},
 
     pluralize (count, word) {

[Killed] StringLiteral
repos/cypress-demo/js/utils.js:12:18
     uuid () {
       /*jshint bitwise:false */
       let i; let random
-      let uuid = ''
+      let uuid = "Stryker was here!"
 
       for (i = 0; i < 32; i++) {

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:14:19
       let i; let random
       let uuid = ''
 
-      for (i = 0; i < 32; i++) {
+      for (i = 0; false; i++) {
         random = Math.random() * 16 | 0
         if (i === 8 || i === 12 || i === 16 || i === 20) {

[Killed] EqualityOperator
repos/cypress-demo/js/utils.js:14:19
       let i; let random
       let uuid = ''
 
-      for (i = 0; i < 32; i++) {
+      for (i = 0; i <= 32; i++) {
         random = Math.random() * 16 | 0
         if (i === 8 || i === 12 || i === 16 || i === 20) {

[Killed] ArithmeticOperator
repos/cypress-demo/js/utils.js:15:18
       let uuid = ''
 
       for (i = 0; i < 32; i++) {
-        random = Math.random() * 16 | 0
+        random = Math.random() / 16 | 0
         if (i === 8 || i === 12 || i === 16 || i === 20) {
           uuid += '-'

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:16:24
 
       for (i = 0; i < 32; i++) {
         random = Math.random() * 16 | 0
-        if (i === 8 || i === 12 || i === 16 || i === 20) {
+        if (i === 8 || true || i === 16 || i === 20) {
           uuid += '-'
         }

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:16:13
 
       for (i = 0; i < 32; i++) {
         random = Math.random() * 16 | 0
-        if (i === 8 || i === 12 || i === 16 || i === 20) {
+        if (true) {
           uuid += '-'
         }

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:20:34
           uuid += '-'
         }
 
-        uuid += (i === 12 ? 4 : (i === 16 ? (random & 3 | 8) : random))
+        uuid += (i === 12 ? 4 : (true ? (random & 3 | 8) : random))
         .toString(16)
       }

[Killed] EqualityOperator
repos/cypress-demo/js/utils.js:20:34
           uuid += '-'
         }
 
-        uuid += (i === 12 ? 4 : (i === 16 ? (random & 3 | 8) : random))
+        uuid += (i === 12 ? 4 : (i !== 16 ? (random & 3 | 8) : random))
         .toString(16)
       }

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:27:29
       return uuid
     },
 
-    pluralize (count, word) {
-      return count === 1 ? word : `${word}s`
-    },
+    pluralize (count, word) {},
 
     store (namespace, data) {

[Killed] EqualityOperator
repos/cypress-demo/js/utils.js:28:14
     },
 
     pluralize (count, word) {
-      return count === 1 ? word : `${word}s`
+      return count !== 1 ? word : `${word}s`
     },
 

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:28:14
     },
 
     pluralize (count, word) {
-      return count === 1 ? word : `${word}s`
+      return false ? word : `${word}s`
     },
 

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:31:29
       return count === 1 ? word : `${word}s`
     },
 
-    store (namespace, data) {
-      if (data) {
-        return localStorage.setItem(namespace, JSON.stringify(data))
-      }
-
-      let store = localStorage.getItem(namespace)
-
-      return (store && JSON.parse(store)) || []
-    },
+    store (namespace, data) {},
 
     extend (...args) {

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:32:11
     },
 
     store (namespace, data) {
-      if (data) {
+      if (true) {
         return localStorage.setItem(namespace, JSON.stringify(data))
       }

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:32:17
     },
 
     store (namespace, data) {
-      if (data) {
-        return localStorage.setItem(namespace, JSON.stringify(data))
-      }
+      if (data) {}
 
       let store = localStorage.getItem(namespace)

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:38:15
 
       let store = localStorage.getItem(namespace)
 
-      return (store && JSON.parse(store)) || []
+      return (true) || []
     },
 

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:38:14
 
       let store = localStorage.getItem(namespace)
 
-      return (store && JSON.parse(store)) || []
+      return true
     },
 

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:41:22
       return (store && JSON.parse(store)) || []
     },
 
-    extend (...args) {
-      let newObj = {}
-
-      for (let i = 0; i < args.length; i++) {
-        let obj = args[i]
-
-        for (let key in obj) {
-          if (obj.hasOwnProperty(key)) {
-            newObj[key] = obj[key]
-          }
-        }
-      }
-
-      return newObj
-    },
+    extend (...args) {},
   }
 })()

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:44:45
     extend (...args) {
       let newObj = {}
 
-      for (let i = 0; i < args.length; i++) {
-        let obj = args[i]
-
-        for (let key in obj) {
-          if (obj.hasOwnProperty(key)) {
-            newObj[key] = obj[key]
-          }
-        }
-      }
+      for (let i = 0; i < args.length; i++) {}
 
       return newObj

[Killed] BlockStatement
repos/cypress-demo/js/utils.js:47:30
       for (let i = 0; i < args.length; i++) {
         let obj = args[i]
 
-        for (let key in obj) {
-          if (obj.hasOwnProperty(key)) {
-            newObj[key] = obj[key]
-          }
-        }
+        for (let key in obj) {}
       }
 

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:48:15
         let obj = args[i]
 
         for (let key in obj) {
-          if (obj.hasOwnProperty(key)) {
+          if (false) {
             newObj[key] = obj[key]
           }

[Killed] ConditionalExpression
repos/cypress-demo/js/utils.js:48:15
         let obj = args[i]
 
         for (let key in obj) {
-          if (obj.hasOwnProperty(key)) {
+          if (true) {
             newObj[key] = obj[key]
           }
